index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flight 404 Not found</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Flight 404 Not found</h1>
<div class="header">
  <style>
    .header{text-align: center;}
  </style>
  <div class="menu-container">
    <span class="menu">
      <a href="/">home</a>
    </span>
      -
    <span class="menu">
      <a href="/assignments.html">assignments</a>
    </span>
      -
    <span class="menu">
      <a href="/contact.html">contact</a>
    </span>
  </div>
</div> 

<div id="outline-container-org45f67cf" class="outline-2">
<h2 id="org45f67cf">About Flight Gear</h2>
<div class="outline-text-2" id="text-org45f67cf">
<p>
FlightGear is a completely free and open-source flight simulator, supported for a wide variety of operating systems such as Windows, MacOS, Linux, and FreeBSD. Since 1997, FlightGear has been developed with the goal to create a sophisticated flight simulator that can be used by researchers, pilot trainee's, engineers, and enthusiasts alike. The open-source nature of the project allows anyone with the desire to learn or contribute develop and build their own projects on top of the simulator. FlightGear is fundamentally a community project developed by vontunteers world-wide. The goal of the team's project is to analyze the software architecture of the project, present its findings, and suggest enhancements to the project.
</p>
</div>
</div>

<div id="outline-container-orgc2be0db" class="outline-2">
<h2 id="orgc2be0db">Relevant Links</h2>
<div class="outline-text-2" id="text-orgc2be0db">
</div>
<div id="outline-container-orge563c81" class="outline-3">
<h3 id="orge563c81">Official FlightGear Resources</h3>
<div class="outline-text-3" id="text-orge563c81">
<ul class="org-ul">
<li><a href="https://www.flightgear.org/">FlightGear Website</a></li>
<li><a href="https://wiki.flightgear.org/Main_Page">FlightGear Wiki</a></li>
<li><a href="https://sourceforge.net/p/flightgear/flightgear/ci/next/tree/">FlightGear Source Code on Sourceforge</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc09418b" class="outline-3">
<h3 id="orgc09418b">Books</h3>
<div class="outline-text-3" id="text-orgc09418b">
<ul class="org-ul">
<li><a href="https://www.oreilly.com/library/view/flight-simulation-software/9781119737674/?sso_link=yes&amp;sso_link_from=queens-university">Flight Simulation Software</a></li>
<li><a href="https://onlinelibrary.wiley.com/doi/book/10.1002/9780470685662">Principles of Flight Simulation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgca5f53c" class="outline-3">
<h3 id="orgca5f53c">Scientific Papers</h3>
<div class="outline-text-3" id="text-orgca5f53c">
<ul class="org-ul">
<li><a href="https://ieeexplore.ieee.org/document/5364558">Architecture Development of Research Flight Simulator Based on COTS</a></li>
<li><a href="https://ieeexplore.ieee.org/document/8356168">Automated Testing of Simulation Software in the Aviation Industry: An Experience Report</a></li>
<li><a href="https://ieeexplore.ieee.org/document/9336527">Flight Simulator Architecture and Computer System Design and Research</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
